artillery/test.yml
config:
  target: "https://catfact.ninja"
  phases:
    - duration: 60
      arrivalRate: 10
  payload:
    path: "./payload.json"
    fields:
      - "fact"
  defaults:
    headers:
      content-type: "application/json"
scenarios:
  - flow:
      - get:
          url: "/fact"
      - post:
          url: "/facts"
          json:
            fact: "{{ fact }}"
      - ensure:
          - response_code:
              equals: 200
      - ensure:
          - response_time:
              less_than: 2000
      - verify:
          - match:
              json: "fact"
  - flow:
      - get:
          url: "/facts"
      - ensure:
          - response_code:
              equals: 200
      - ensure:
          - response_time:
              less_than: 2000
      - ensure:
          - metrics:
              - response_time:
                  type: "response_time"
                  threshold: 95
                  value: 1000
              - errors:
                  type: "error_rate"
                  threshold: 99
                  value: 0
              - requests:
                  type: "requests_per_second"
                  threshold: 10
                  value: 100